{
  "architectures": [
    "Phi4ForCausalLMV"
  ],
  "auto_map": {
    "AutoConfig": "modeling_phi4_visionr.Phi4VisionR",
    "AutoModelForCausalLM": "modeling_phi4_visionr.Phi4ForCausalLMV",
    "AutoProcessor": "processing_phi4_visionr.Phi4VisionRProcessor"
  },
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 100257,
  "dtype": "bfloat16",
  "embd_pdrop": 0.0,
  "eos_token_id": 100265,
  "freeze_mm_mlp_adapter": false,
  "hidden_act": "silu",
  "hidden_size": 5120,
  "image_aspect_ratio": "square",
  "initializer_range": 0.02,
  "intermediate_size": 17920,
  "max_num_patches": 3600,
  "max_position_embeddings": 32768,
  "min_num_patches": 256,
  "mm_hidden_size": 1152,
  "mm_projector_lr": 2e-05,
  "mm_projector_type": "mlp2x_gelu",
  "mm_vision_tower": "google/siglip2-so400m-patch16-naflex",
  "model_type": "phi4-siglip",
  "num_attention_heads": 40,
  "num_hidden_layers": 40,
  "num_key_value_heads": 10,
  "original_max_position_embeddings": 32768,
  "pad_token_id": 100349,
  "partial_rotary_factor": 1.0,
  "resid_pdrop": 0.0,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 500000,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "tokenizer_model_max_length": 8192,
  "tokenizer_padding_side": "right",
  "transformers_version": "4.56.1",
  "tune_mm_mlp_adapter": false,
  "unfreeze_vision_tower": true,
  "use_cache": false,
  "use_mm_proj": true,
  "use_s2": false,
  "vocab_size": 100352,
  "vision_config": {
    "hidden_size": 1152,
    "intermediate_size": 4304,
    "model_type": "siglip2_vision_model",
    "num_attention_heads": 16,
    "num_hidden_layers": 27
  }
}
